NATURE_CHOICES = (
    (1, '国企'),
    (2, '民营'),
    (3, '合资'),
    (4, '外商独资'),
    (5, '股份制企业'),
    (6, '上市公司'),
    (7, '代表处'),
    (8, '国家机关'),
    (9, '事业单位'),
    (10, '银行'),
    (11, '医院'),
    (12, '学校/下级学院'),
    (13, '律师事务所'),
    (14, '社会团体'),
    (15, '港澳台公司'),
    (16, '其他'),
)
FINANCING_STATUS_CHOICES = (
    (1, "未融资"),
    (2, "天使轮"),
    (3, "A轮"),
    (4, "B轮"),
    (5, "C轮"),
    (6, "D轮及以上"),
    (7, "已上市"),
    (8, "无融资计划"),
)
PROVINCES_CHOICES = (
    (1, "上海"),
    (2, "江苏"),
    (3, "浙江"),
    (4, "安徽"),
    (5, "北京"),
    (6, "天津"),
    (7, "广东"),
    (8, "河北"),
    (9, "河南"),
    (10, "山东"),
    (11, "湖北"),
    (12, "湖南"),
    (13, "江西"),
    (14, "福建"),
    (15, "四川"),
    (16, "重庆"),
    (17, "广西"),
    (18, "山西"),
    (19, "辽宁"),
    (20, "吉林"),
    (21, "黑龙江"),
    (22, "贵州"),
    (23, "陕西"),
    (24, "云南"),
    (25, "内蒙古"),
    (26, "甘肃"),
    (27, "青海"),
    (28, "宁夏"),
    (29, "新疆"),
    (30, "海南"),
    (31, "西藏"),
    (32, "中国香港"),
    (33, "中国澳门"),
    (34, "中国台湾"),
    (35, "海外"),
)
TIME_UNIT_CHOICES = (
    (0, "年"),
    (1, "月"),
    (2, "日"),
)
YEAR_CHOICES = (
    (0, '无经验'),
    (1, '经验不限'),
    (2, '1年以下'),
    (3, '1-3年'),
    (4, '3-5年'),
    (5, '5-10年'),
    (6, '10年以上'),
)
JOB_NATURE_CHOICES = (
    (1, "全职"),
    (2, "兼职"),
    (3, "实习"),
    (4, "校园"),
    (0, "不限"),
)
"""
0.招聘时间之前，未处理的主动投递；
1.被退回的投递；
2.被通过的投递；
3.由hr主动撤销的招聘，或过期的招聘；
4.主动撤销的投递；
5.被动建立的投递关系；
"""

PROGRESS_CHOICES = (
    (0, '未开始'),
    (1, '已退回'),
    (2, '已通过'),
    (3, '招聘已关闭'),
    (4, '投递已撤销'),
    (5, '邀请中'),
)


SKILL_CHOICES = (
    (0, "一般"),
    (1, "了解"),
    (2, "中等"),
    (3, "熟悉"),
    (4, "精通"),
)

NATIONS = (
    (0, "汉族"), (1, "蒙古族"), (2, "回族"), (3, "藏族"), (4, "维吾尔族"),
    (5, "苗族"), (6, "彝族"), (7, "壮族"), (8, "布依族"), (9, "朝鲜族"), (10, "满族"),
    (11, "侗族"), (12, "瑶族"), (13, "白族"), (14, "土家族"), (15, "哈尼族"), (16, "哈萨克族"),
    (17, "傣族"), (18, "黎族"), (19, "傈僳族"), (20, "佤族"), (21, "畲族"), (22, "高山族"), (23, "拉祜族"),
    (24, "水族"), (25, "东乡族"), (26, "纳西族"), (27, "景颇族"), (28, "柯尔克孜族"), (29, "土族"),
    (30, "达斡尔族"), (31, "仫佬族"), (32, "羌族"), (33, "布朗族"), (34, "撒拉族"), (35, "毛南族"),
    (36, "仡佬族"), (37, "锡伯族"), (38, "阿昌族"), (39, "普米族"), (40, "塔吉克族"), (41, "怒族"),
    (42, "乌孜别克族"), (43, "俄罗斯族"), (44, "鄂温克族"), (45, "德昂族"), (46, "保安族"), (47, "裕固族"),
    (48, "京族"), (49, "塔塔尔族"), (50, "独龙族"), (51, "鄂伦春族"), (52, "赫哲族"), (53, "门巴族"),
    (54, "珞巴族"), (55, "基诺族")
)
"""待修改"""
EDUCATION_LEVELS = (
    (0, "无"),
    (1, "小学"),
    (2, "初中"),
    (3, "高中/中职/中专"),
    (4, "高职/高专"),
    (5, "本科/职业本科"),
    (6, "硕士研究生"),
    (7, "硕士博士生"),
)

MARTIAL_CHOICES = (
    (0, "未婚"),
    (1, "已婚"),
)

USER_CLASSES = (
    (0, "普通求职者"),
    (1, "智能智造学员"),
    (2, "VIP学员/用户"),
    (3, "企业用户"),
    (4, "VIP企业用户"),
)

SEX_CHOICE = (
    (0, '女'),
    (1, '男'),
)

BONUS_CHOICES = (
    (0, '五险一金'),
    (1, '年底双薪'),
    (2, '绩效奖金'),
    (3, '年终分红'),
    (4, '股票期权'),
    (5, '加班补助'),
    (6, '全勤奖'),
    (7, '包吃'),
    (8, '包住'),
    (9, '交通补助'),
    (10, '餐补'),
    (11, '房补'),
    (12, '通讯补贴'),
    (13, '采暖补贴'),
    (14, '高温补贴'),
    (15, '弹性工作'),
    (16, '补充医疗保险'),
    (17, '定期体检'),
    (18, '免费班车'),
    (19, '员工旅游'),
    (20, '带薪年假'),
    (21, '节日福利'),
    (22, '不加班'),
    (23, '14薪'),
    (24, '无试用期'),
    (25, '免息房贷'),
    (26, '每年多次调薪'),
    (27, '健身俱乐部'),
    (28, '周末双休'),
)

ENTITY_LIST = (
    (0, "企业"),
    (1, "用户"),
    (2, "简历"),
    (3, "职位"),
)

XET_VALIDATION = (
    (0, "未认证"),
    (1, "已认证"),
    (2, "认证未通过"),
    (3, "审核中"),
)

TEACHING_FIELDS = (
    (0, "综合领域"),
    (1, "PLC"),
    (2, "工业机器人"),
    (3, "机器视觉"),
)

TEACHER_LEVEL = (
    (0, "暂未获取"),
    (1, "助教"),
    (2, "初级讲师"),
    (3, "中级讲师"),
    (4, "高级讲师"),
)

CERTIFICATION_LEVEL = (
    (0, "不分级"),
    (1, "初级"),
    (2, "中级"),
    (3, "高级"),
)

TESTING_WAYS = (
    (0, "无考核"),
    (1, "笔试+实操"),
    (2, "笔试"),
    (3, "实操"),
)

COURSE_DIRECTION = (
    (0, "PLC"),
    (1, "工业机器人"),
    (2, "机器视觉"),
)

COURSE_TYPE = (
    (0, "技能提升班"),
    (1, "证书取证班"),
    (2, "就业班"),
)

CLASS_TYPE = (
    (0, "线上课"),
    (1, "线下课"),
    (2, "线上下结合"),
)

CLASS_PERIOD = (
    (0, "周末班"),
    (1, "平时班"),
)

CLASS_STATUS = (
    (0, "未开始"),
    (1, "进行中"),
    (2, "已结束"),
    (3, "已关闭"),
)

CERT_PROGRESS_OPTIONS = (
    (0, "未达标"),
    (1, "已完成"),
    (2, "已关闭"),
)
